vkeiper/WT32_Plus_ESP32-S3_WIFI_CANBUS/docs/legacy_code/PSU_Controller/archive/src/CAN_MDK5_4/configuration.c
/*********************************************************************
  * @author  Vince Keiper AstrodyneTDI
  * @version V1.0.0
  * @date    24-June-2015
  * @brief   ICCP Configuration Routines used to save data in non-volatile memory
  * 				 in the ICCP LCD controller we use external NOR flash.
	*					 This is not an EEPROM emmulator so this data should only be written 
	*          to these slots a few times, not hundreds  of times. That would cause 
	*					 data corruption. 
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2015 AstrodyneTDI</center></h2>
  *
  *
  ******************************************************************************  
  */ 


/******************************************************************************/
/*                          include files                                     */
/******************************************************************************/
#include "configuration.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include <ctype.h>
#include "stm324x9i_eval_nor.h"
#include "iccpfuncs.h"

//controller cfg sectgion offset
#define CNTRLCFGOFFSET (0)  // NO TCPIP Stack on this so offset is zero. 
																				 //the last 64K is for controller cfg settings
//tcp/ip stack cfg sectgion offset
#define TCPIPCFGOFFSET 0  //The 1st 192K is for TCP/IP stack CFG storage. 


//config data
typedef enum{CFG_U8,CFG_U16,CFG_CHAR,CFG_U32,CFG_F32,CFG_PTR,CFG_END} e_cfgdatatype_t;

typedef struct 
{
		cfgslotnames_t   slotnames;
		e_cfgdatatype_t  cfgtype[QTYSLOTS];  // what type of data is beng stored
		unsigned int  index;       //qty of entries
		unsigned int  slotname[QTYSLOTS];   //entry name
		unsigned long offset[QTYSLOTS];//offset from section offset
		unsigned int  numbytes[QTYSLOTS]; //length in bytes of entry	
		unsigned int  block[QTYSLOTS];
}s_cfgdata_t;
s_cfgdata_t s_cfgdata;


/**************************************************************************************/
//*            			 
//*							Function: CfgSetArrayData
//*																					  
//**************************************************************************************/
//*(Author: Vince Keiper)
//*				 																		                                         */
/***************************************************************************************/
//uint8_t BSP_NOR_WriteData(uint32_t uwStartAddress, uint16_t* pData, uint32_t uwDataSize)
//void CfgSetStructData(IccpPrfParam_t *pfl, unsigned int SlotName, unsigned char len)
//{
//	unsigned long startaddress;
//	int i,k;
//		
//	for(i=0;i<s_cfgdata.index ;i++)
//	{
//			if(SlotName == s_cfgdata.slotname[i])
//			{	
//					if(len < s_cfgdata.numbytes[i])
//					{
//							//add spaces from last setstr char to length of slot
//							//at the next char at the end of setstr upto SlotLength
//							for(k=len;k<s_cfgdata.numbytes[i]+1;k++)
//							{
//									setdata[k] = 0x00; //pad with zeros						
//							}
//					}
//					startaddress = CNTRLCFGOFFSET + s_cfgdata.offset[i];
//					if(BSP_NOR_WriteData(startaddress, (uint16_t*)setdata, (uint32_t)s_cfgdata.numbytes[i]) != NOR_STATUS_OK)
//					{
//							while(1);
//					}
//					else
//					{
//							return;
//					}
//			}
//	}

//		
//}
/******************************************************************************/



/***************************************************************************************
* @author  Vince Keiper AstrodyneTDI
  * @version V1.0.0
  * @date    21-Sept-2015
  * @brief   Description: You pass in the SlotName of the data stored in NVM.
  *   			 This function looks up the offset and length that is mapped
  *		    	 to that SlotName macro via its respective index. This index is used to 
  *				   get the offset of this slot from the base of memory.
	*					 
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2015 AstrodyneTDI</center></h2>
  *
  *
  ******************************************************************************  
  */ 

void CfgGetArrayData(unsigned char *rtndata, unsigned int SlotName, unsigned char len)
{
	unsigned long startaddress;
	int i;
	
	for(i=0;i<s_cfgdata.index ;i++)
	{
			if(SlotName == s_cfgdata.slotname[i])
			{	
					startaddress = CNTRLCFGOFFSET + s_cfgdata.offset[i];
					
					if(BSP_NOR_ReadData(startaddress, (uint16_t*)rtndata, len) != NOR_STATUS_OK)
						{
							while(1);
					}
					else
					{
							i = s_cfgdata.index + 1; //make sure we exit for loop
					}
					return;
			}
	}		
}
/*****************************************************************************************
*
*	@author Vince Keiper
* @brief  CfgSetArrayData, Response handler. Description: You pass in the SlotName of the data stored in NVM.
*   			 This function looks up the offset and length that is mapped
*		    	 to that SlotName macro via its respective index. This index is used to 
*				   get the offset of this slot from the base of memory.
*					 Since this is NOR flash we must delete the entire block before
*					 trying to write a new value. Before we delete the block we must read all data 
*          that resides in that block into an array, update the data in the local array that
*          matches the slotname we passed in. And then write the entire array back to the block of NOR flash.
*					 Each block of NOR flash is 128KB but I will limit th configuration data struct function to 256 bytes
*					 and not put any other data in the remainder if block0. There are 256 blocks in the NOR flash IC 
*					 we used for at total of 32MB or 256Mb. I will keep block 2 for Web Pages and Block 3 for BMPs 
*					and JPG for the LCD GUI.
* ****************************************************************************************  
* @param *setdata, pointer to buffer that will get wirtten to the NOR flash
* @param SlotName, MACRO of the mapped slot that we want to write to.
* @param len, length of the buffer in bytes, tells the function when to stop writing.
*
* @retval none
******************************************************************************************/
void CfgSetArrayData(unsigned char *setdata, unsigned int SlotName, unsigned char len)
{
	//unsigned long startaddress;
	int i,k,j,l;
	uint8_t lclbuff[256];
	uint32_t stadr_blk;
	
	for(i=0;i<s_cfgdata.index ;i++)
	{
			if(SlotName == s_cfgdata.slotname[i])
			{	
					if(len < s_cfgdata.numbytes[i])
					{
							//add spaces from last setstr char to length of slot
							//at the next char at the end of setstr upto SlotLength
							for(k=len;k<s_cfgdata.numbytes[i]+1;k++)
							{
									setdata[k] = 0x00; //pad with zeros						
							}
					}
					stadr_blk = 0;// ech block has 128KB of data, we should not need more than that for config info
					
					// index the data for the SLOT we passed in is located at
					//startaddress = CNTRLCFGOFFSET + s_cfgdata.offset[i];
		
//					for(block=0;block<NORQTYBLOCKS;block++)
//					{
//							if(s_cfgdata.block[i]==block)
//							{
//								stadr_blk = (s_cfgdata.block[i]-1) * 0xFFFF; // start address for each block data = block has 0xFFFF of 16 bit data blocks 128KB per block
//								break;
//							}
//					}
					// realistically lok this to block 1 128KB is plenty of data for configuration
					//if( s_cfgdata.block[i] ==1)
					//{
					//		stadr_blk = 0;
					//}
					//else 
					//if( s_cfgdata.block[i] ==2)
					//{
				///			stadr_blk = 0x00020000;// start address of block 2 in NOR
				//	}
					memset(lclbuff,0x00,256);
					if(BSP_NOR_ReadData(stadr_blk, (uint16_t*)lclbuff, 128) != NOR_STATUS_OK)
					{
							while(1);
					}
					
					//replace bytes for the slot we are writing in lclbuff so
					//we can re-write entire block at once
					l=0;
					for(j=s_cfgdata.offset[i];j<((s_cfgdata.numbytes[i]+1)+s_cfgdata.offset[i]);j++)
					{
							lclbuff[j] = setdata[l]; //copy passed in data to local buffer					
							l++;
					}
					
					// Erase block for re-write ( its NOR flash so you cannot re-write w/o erase)
					if(BSP_NOR_Erase_Block(stadr_blk) != NOR_STATUS_OK)
					{
							GuiState.statusreg &= 0xff7f; //and off bit 7 NOR FLASH bit
							while(1);//error lock up for re-boot t happen
					}
					else
					{
							if(BSP_NOR_WriteData(stadr_blk, (uint16_t*)lclbuff, 128) != NOR_STATUS_OK)
							{
									GuiState.statusreg &= 0xff7f; //and off bit 7 NOR FLASH bit
									while(1);
							}
							else
							{
									return;
							}
					}
			}
	}

		
