vkeiper/WT32_Plus_ESP32-S3_WIFI_CANBUS/docs/legacy_code/PSU_Controller/archive/src/CAN_MDK5_4/configuration.c
}
/******************************************************************************/


//static float fourbytes2float(unsigned char *ptr2fourbytearray);

//float fourbytes2float(unsigned char *ptr2fourbytearray)
//{
//	float f_data;
//	unsigned char *ptr2float = (unsigned char*)&f_data;
//	int i;
//	for (i=0;i<4;i++)
//	{
//          *(ptr2float++) = *ptr2fourbytearray++;
//	}
//	return f_data;
//}




void CfgGetAsciiData(char *rtndata, unsigned int SlotName, unsigned char len)
{
	unsigned long startaddress;
	int i;
	
	for(i=0;i<s_cfgdata.index ;i++)
	{
			if(SlotName == s_cfgdata.slotname[i])
			{	
					startaddress = CNTRLCFGOFFSET + s_cfgdata.offset[i];

					if(BSP_NOR_ReadData(startaddress, (uint16_t*)rtndata, (uint32_t)s_cfgdata.numbytes[i]) != NOR_STATUS_OK)
					{
							while(1);
					}
					else
					{
							i = s_cfgdata.index + 1; //make sure we exit for loop
					}
					return;
			}
	}		
}

void CfgSetAsciiData(char *setstr, unsigned int SlotName,unsigned char len)
{
	unsigned long startaddress;
	int i,k;
		
	for(i=0;i<s_cfgdata.index ;i++)
	{
			if(SlotName == s_cfgdata.slotname[i])
			{	
					if(len < s_cfgdata.numbytes[i])
					{
							//add spaces from last setstr char to length of slot
							//at the next char at the end of setstr upto SlotLength
							for(k=len;k<s_cfgdata.numbytes[i]+1;k++)
							{
									setstr[k] = 0x32; //pad with ascii spaces						
							}
					}
					startaddress = CNTRLCFGOFFSET + s_cfgdata.offset[i];
					if(BSP_NOR_WriteData(startaddress, (uint16_t*)setstr, (uint32_t)s_cfgdata.numbytes[i]) != NOR_STATUS_OK)
					{
							while(1);
					}
					else
					{
							return;
					}
			}
	}

		
}



/******************************************************************************/


//void CfgGetEepromByteData(unsigned char *rtndata, unsigned int SlotName)
//{
//	unsigned long startaddress;
//	unsigned int i;
//	for(i=0;i<LastConfigIndex;i++)
//	{
//		if(SlotName == ConfigEepromName[i])
//		{	
//			startaddress = CNTRLCFGOFFSET + ConfigEepromOffset[i];
//			XEEReadArray(startaddress, rtndata,ConfigEepromLength[i]);
//			i = LastConfigIndex + 1; //make sure we exit for loop
//			return;
//		}
//	}		
//}
///**************************************************************************************/

//void CfgSetEepromByteData(unsigned char *setdata,unsigned int SlotName)
//{
//	unsigned long startaddress;
//	int i;


//        //loop until we find the slot that matches the name we passed in
//	for(i=0;i<LastConfigIndex;i++)
//	{
//		if(SlotName == ConfigEepromName[i])
//		{
//			startaddress = CNTRLCFGOFFSET + ConfigEepromOffset[i];
//			XEEBeginWrite(startaddress);
//			XEEWriteArray(setdata, ConfigEepromLength[i]);
//                }
//	}


//}
/**************************************************************************************/
//            			 
//							Function: CreatConfigMemMap
//                                                                                    */
/**************************************************************************************/
//
// Description: Populates a struct array called ConfigEeprom. This sets up what the
//				Eeprom data slots are named, what memory offset they get written to and how many 
//        bytes the data in that slot is. This builds the memory map.
//
// Inputs: None
//
// Outputs: Struct Array elements up to 65535 indexes.
//			LastConfigIndex... value equal to the last array index
//							   +1. To provide stop mechanism in the for loop	
//
// Dependencies: NOR flash must be initialized and redy to read & writtn to.	
//				 																				
/***************************************************************************************/

void CreateConfigMemMap(void)
{
	unsigned int i;
	      
//0
	i=0;
	s_cfgdata.slotname[i]    = MODEL;
	s_cfgdata.offset[i]      = 0;//offset from base of EEPROM
	s_cfgdata.numbytes[i]    = 16; // 16 characters in length max
	s_cfgdata.cfgtype[i]  	 = CFG_CHAR;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
//1
	i++;
	s_cfgdata.slotname[i]    = SERIAL;
	s_cfgdata.offset[i]      = s_cfgdata.offset[i-1] + s_cfgdata.numbytes[i-1];  //offset
	s_cfgdata.numbytes[i]    = 16; //length
	s_cfgdata.cfgtype[i]  	 = CFG_CHAR;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
//2
	i++;
	s_cfgdata.slotname[i]    = VERSION;
	s_cfgdata.offset[i]      = s_cfgdata.offset[i-1] + s_cfgdata.numbytes[i-1];  //offset
	s_cfgdata.numbytes[i]    = 16; //length
	s_cfgdata.cfgtype[i]  	 = CFG_CHAR;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
//3  typedef enum{CFG_U8,CFG_U16,CFG_CHAR,CFG_U32,CFG_F32,CFG_PTR,CFG_END} e_cfgdatatype_t;
	i++;
	s_cfgdata.slotname[i]    = IPADR;
	s_cfgdata.offset[i]      = s_cfgdata.offset[i-1] + s_cfgdata.numbytes[i-1];  //offset
	s_cfgdata.numbytes[i]    = 4; //length
	s_cfgdata.cfgtype[i]  	 = CFG_U8;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
//4
	i++;
  s_cfgdata.slotname[i]    = MACADR;
	s_cfgdata.offset[i]      = s_cfgdata.offset[i-1] + s_cfgdata.numbytes[i-1];  //offset
	s_cfgdata.numbytes[i]    = 6; //length
	s_cfgdata.cfgtype[i]  	 = CFG_U8;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
//5
	i++;
  s_cfgdata.slotname[i]    = NETMSK;
	s_cfgdata.offset[i]      = s_cfgdata.offset[i-1] + s_cfgdata.numbytes[i-1];  //offset
	s_cfgdata.numbytes[i]    = 4; //length
	s_cfgdata.cfgtype[i]  	 = CFG_U8;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
//6
	i++;
  s_cfgdata.slotname[i]    = GWY;
	s_cfgdata.offset[i]      = s_cfgdata.offset[i-1] + s_cfgdata.numbytes[i-1];  //offset
	s_cfgdata.numbytes[i]    = 4; //length
	s_cfgdata.cfgtype[i]  	 = CFG_U8;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
//7
	i++;
  s_cfgdata.slotname[i]    = PRFL0;
	s_cfgdata.offset[i]      = s_cfgdata.offset[i-1] + s_cfgdata.numbytes[i-1];  //offset
	s_cfgdata.numbytes[i]    = 32; //length
	s_cfgdata.cfgtype[i]  	 = CFG_PTR;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
//8
	i++;
  s_cfgdata.slotname[i]    = PRFL1;
	s_cfgdata.offset[i]      = s_cfgdata.offset[i-1] + s_cfgdata.numbytes[i-1];  //offset
	s_cfgdata.numbytes[i]    = 32; //length
	s_cfgdata.cfgtype[i]  	 = CFG_PTR;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
//9
	i++;
  s_cfgdata.slotname[i]    = PRFL2;
	s_cfgdata.offset[i]      = s_cfgdata.offset[i-1] + s_cfgdata.numbytes[i-1];  //offset
	s_cfgdata.numbytes[i]    = 32; //length
	s_cfgdata.cfgtype[i]  	 = CFG_PTR;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
//10
	i++;
  s_cfgdata.slotname[i]    = PRFL3;
	s_cfgdata.offset[i]      = s_cfgdata.offset[i-1] + s_cfgdata.numbytes[i-1];  //offset
	s_cfgdata.numbytes[i]    = 32; //length
	s_cfgdata.cfgtype[i]  	 = CFG_PTR;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
//11
	i++;
  s_cfgdata.slotname[i]    = LOCATION;
	s_cfgdata.offset[i]      = s_cfgdata.offset[i-1] + s_cfgdata.numbytes[i-1];  //offset
	s_cfgdata.numbytes[i]    = 16; //length
	s_cfgdata.cfgtype[i]  	 = CFG_CHAR;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
	
//12
	i++;
  s_cfgdata.slotname[i]    = TCHCAL;
	s_cfgdata.offset[i]      = s_cfgdata.offset[i-1] + s_cfgdata.numbytes[i-1];  //offset
	s_cfgdata.numbytes[i]    = 2; //length
	s_cfgdata.cfgtype[i]  	 = CFG_U32;
	s_cfgdata.block[i]       = (s_cfgdata.offset[i]/NORBLKSZ)+1; // determine what block of NOR in which this data resides
	
