vkeiper/WT32_Plus_ESP32-S3_WIFI_CANBUS/docs/legacy_code/PSU_Controller/archive/src/CAN_MDK5_4/configuration.c
	s_cfgdata.index = i+1;  //this should equal the last index +1 in this structurearray
}
///////////////////////////////////////////////////////////////////////////
/******************************************************************************/
/******************************************************************************/
/* Author: Vince Keiper         CfgGetCalData	    			 	     	  */
// Description:
//		   Called by Config functions that returns 32 bit double(float & double are the same in C30 & XC16 compilers)
//			back to the calling functions. We also want to save the result in a 4 byte array to tranfers out over CAN
//			for CalData read functions. This is done by passing in a pointer to an array that will store the result to  	
// Inputs: Defined SlotNames from Configuration.h tell CfgGet function what
//			address to go get the data from.
/******************************************************************************/

//float CfgGetCalData(unsigned int CalSlotName, unsigned char *bytedataresult)
//{
//    float result;
//    unsigned char *ptr= (unsigned char *)&result;
//    unsigned char i;
//    unsigned char bytedata[4];
//		
//    CfgGetEepromByteData(bytedata,CalSlotName);
//    // since data was saved from float32 we had to
//    // break it down by accessing bytes wth pointer
//    // and saving byte by byte. So we need to do the
//    // inverse to retrieve the float by building it
//    // byte by byte.
//    // loop through saving byte to array eah time
//    for (i=0;i<4;i++)
//    {
//        *(ptr++)=bytedata[i];
//        *(bytedataresult++)=bytedata[i];

//    }
//    
//    return result;
//}
///////////////////////////////////////////////////////////////////////////
/******************************************************************************/
/******************************************************************************/
/* Author: Vince Keiper         CfgSetCalData	    			 	     	  */
// Description:
//		   Called by Config functions passes in float32. 32 bit double
//		   (float & double are the same in C30 & XC16 compilers)
//		   CAN functions fro frontpanel can call this to set the caldata
//		   I also wrote a function to program default config data if it detects
//		   no cal blocks have been programmed yet, which could be dangerous and
//		   because gain could be very high or very low. So we need to control this
//		   and check on every boot up.
//		
// Inputs: Defined SlotNames from Configuration.h tell CfgSet function what
//			address to set the data.
/******************************************************************************/

//void CfgSetCalData(float fdata, unsigned int CalSlotName)
//{
//	unsigned char *ptr= (unsigned char *)&fdata;
//    unsigned char i;
//	unsigned char bytedata[4];

//    for (i=0;i<4;i++)
//    {
//	    bytedata[i] = *(ptr++);
//	}
//	
//	CfgSetEepromByteData(bytedata,CalSlotName);	
//}


/**
*  Init Variables that are stored in CFG section of 256K EEPROM - 
*/
unsigned char InitConfigVars(void)
{
    

//	unsigned char *ptrmodel= (unsigned char * )&modelnum;//point to global model number variable
//	unsigned char CriticalConfigDataValid=TRUE;
	
//	gbl_f32_vsetgain = CfgGetCalData(VSETGAIN,gbl_vsetgain_array);
//	//check to see if gain was returned
//	if(!IsValidGain(gbl_f32_vsetgain,VOLTSTYPE)){CriticalConfigDataValid=FALSE;}

//	gbl_f32_vsetoffset = CfgGetCalData(VSETOFFSET,gbl_vsetoffset_array);
//	//check to see if gain was returned
//	if(!IsValidOffset(gbl_f32_vsetoffset,VOLTSTYPE)){CriticalConfigDataValid=FALSE;}

//	gbl_f32_vrdbgain = CfgGetCalData(VREADGAIN,gbl_vrdbgain_array);
//	//check to see if gain was returned
//	if(!IsValidGain(gbl_f32_vrdbgain,VOLTSTYPE)){CriticalConfigDataValid=FALSE;}

//	gbl_f32_vrdboffset = CfgGetCalData(VREADOFFSET,gbl_vrdboffset_array);
//	//check to see if gain was returned
//	if(!IsValidOffset(gbl_f32_vrdboffset,VOLTSTYPE)){CriticalConfigDataValid=FALSE;}

//	gbl_f32_isetgain = CfgGetCalData(ISETGAIN,gbl_isetgain_array);
//	//check to see if gain was returned
//	if(!IsValidGain(gbl_f32_isetgain,AMPSTYPE)){CriticalConfigDataValid=FALSE;}

//	gbl_f32_isetoffset = CfgGetCalData(ISETOFFSET,gbl_isetoffset_array);
//	//check to see if gain was returned
//	if(!IsValidOffset(gbl_f32_isetoffset,AMPSTYPE)){CriticalConfigDataValid=FALSE;}

//	gbl_f32_irdbgain = CfgGetCalData(IREADGAIN,gbl_irdbgain_array);
//	//check to see if gain was returned
//	if(!IsValidGain(gbl_f32_irdbgain,AMPSTYPE)){CriticalConfigDataValid=FALSE;}

//	gbl_f32_irdboffset = CfgGetCalData(IREADOFFSET,gbl_irdboffset_array);
//	//check to see if gain was returned
//	if(!IsValidOffset(gbl_f32_irdboffset,AMPSTYPE)){CriticalConfigDataValid=FALSE;}
//	
//	gbl_f32_psetgain = CfgGetCalData(PSETGAIN,gbl_psetgain_array);
//	//check to see if gain was returned
//	if(!IsValidGain(gbl_f32_psetgain,WATTSTYPE)){CriticalConfigDataValid=FALSE;}
//	
//	gbl_f32_psetoffset = CfgGetCalData(PSETOFFSET,gbl_psetoffset_array);
//	//check to see if gain was returned
//	if(!IsValidOffset(gbl_f32_psetoffset,WATTSTYPE)){CriticalConfigDataValid=FALSE;}

//	//	example how to read ascii from EE
//	CfgGetEepromAsciiData(serialnumber, SERIAL);
//	CfgGetEepromAsciiData(builddate, BLDDTE);
//	CfgGetEepromAsciiData(codever, CODEVER);

//        CfgGetEepromByteData(ptrmodel, MODELNUM);//Populate model number var

//        if(modelnum == 0x00 || modelnum == 0xFF ){modelnum = MODELSPS5930;}

//        if(modelnum == MODELSPS5979)
//        {
//            s_Controldcdc.otpval = 75;// Dragon over temp threshold is 75
//            s_Controldcdc.RatedAmps = 12000;
//            s_Controldcdc.RatedVolts = 6300;
//            s_Controldcdc.RatedWatts = 5500;
//        }
//        else if(modelnum == MODELSPS5930)
//        {
//            s_Controldcdc.otpval = 85;// Std LB  over temp threshold is 85
//            s_Controldcdc.RatedAmps = 12000;
//            s_Controldcdc.RatedVolts = 6300;
//            s_Controldcdc.RatedWatts = 5500;
//        }

//        // if fixed output mode setting is outsidce of normal bounds set it to fully adjustable until
//        // they get re-programmed by interface of ProgramCriticalConfigVars() is run
//        gbl_f32_defwatts = CfgGetCalData(DEFWATTS,gbl_defwatts_array);
//        if(gbl_f32_defwatts > 5500 || gbl_f32_defwatts < 0){gbl_f32_defwatts =0;}

//        gbl_f32_defamps = CfgGetCalData(DEFAMPS,gbl_defamps_array);
//        if(gbl_f32_defamps > 130 || gbl_f32_defamps < 0){gbl_f32_defamps =0;}

//        gbl_f32_defvolts = CfgGetCalData(DEFVOLTS,gbl_defvolts_array);
//        if(gbl_f32_defvolts > 63 || gbl_f32_defvolts < 0){gbl_f32_defvolts =0;}

//	return CriticalConfigDataValid; 
return 1;
}


//unsigned char IsValidGain(double gain, unsigned char type)
//{
//	unsigned char return_val = FALSE;
//	float lowlimit=0,hilimit=0;
//	if(type == VOLTSTYPE || type == AMPSTYPE)
//	{
//		lowlimit=-3.00;
//		hilimit=3.00;	
//	}
//	else if(type == WATTSTYPE)
//	{
//		lowlimit=-10.00;
//		hilimit=10.00;	
//	}
//	if(gain >lowlimit && gain <hilimit  && gain !=0){return_val = TRUE;}
//	return return_val;	
//}
//unsigned char IsValidOffset(double offset, unsigned char type)
//{
//	unsigned char return_val = FALSE;
//	float lowlimit=0,hilimit=0;
//	if(type == VOLTSTYPE || type == AMPSTYPE)
//	{
//		lowlimit=-10.00;
//		hilimit=10.00;	
//	}
//	else if(type == WATTSTYPE)
//	{
//		lowlimit=-30.00;
//		hilimit=30.00;	
//	}
//	if(offset > lowlimit && offset < hilimit){return_val = TRUE;}
//	return 1;//return_val;	
//}
////////////////////////////////////////////////////////////////////////////////
//
// This is executed if the unit is brand new and the EEPROM is all 0xFF
// after this the unit will be a fully adjustable SPS5930 Std LB with all
// gains & offsets pgm'd to 1&0's respecively.
//
////////////////////////////////////////////////////////////////////////////////
unsigned char ProgramCriticalConfigData(void)
{
//	float gain,offset;

//	gain = 1.00;
//	offset = 0;
//	CfgSetCalData(gain,VSETGAIN);
//	CfgSetCalData(offset,VSETOFFSET);
//	CfgSetCalData(gain,ISETGAIN);
//	CfgSetCalData(offset,ISETOFFSET);
//	CfgSetCalData(gain,VREADGAIN);
//	CfgSetCalData(offset,VREADOFFSET);
//	CfgSetCalData(gain,IREADGAIN);
//	CfgSetCalData(offset,IREADOFFSET);
//	CfgSetCalData(gain,PSETGAIN);
//	CfgSetCalData(offset,PSETOFFSET);
//        
//        //Default PSU to fully adjustable
//        CfgSetCalData(0,DEFWATTS);
//	CfgSetCalData(0,DEFAMPS);
//	CfgSetCalData(0,DEFVOLTS);

