vkeiper/WT32_Plus_ESP32-S3_WIFI_CANBUS/docs/legacy_code/PSU_Controller/archive/src/CAN_MDK5_4/configuration.c
//        unsigned char modelset_ary[1];
//        modelset_ary[0] = MODELSPS5930;
//	//Set Model to Std Liqua Blade
//        CfgSetEepromByteData((unsigned char *)modelset_ary, MODELNUM);

        return 1;
}
/////////////////////////////////////////////////////////////////////////////////
/////
//			EEFactReset sets 64K from the offset passed in. The cfg data
//			for the controller is stored in the 1st 64K. If a 256K EE is used
//			the offet passed in should be set to 192000, because the 1st
//			192K is used for TCPIP stack info
//
/////
//////////////////////////////////////////////////////////////////////////////////
unsigned char EEFactReset(void)
{
//	unsigned long startaddress;
//	unsigned int i;
//	BYTE zerostr[16];
//	
//	for(i=0;i<17;i++){zerostr[i]= 0xff;}//zero out string
//			
//	for(i=0;i<(4000-1);i++)//16bytes per loop 16*4000= 64000 to equal 
//	{
//		startaddress = CNTRLCFGOFFSET + (i*16);//startaddress 0 + i*16 
//		XEEBeginWrite(startaddress);
//		XEEWriteArray(zerostr, sizeof(zerostr));	
//	}		
//	
//	
return 1;
}
/////////////////////////////////////////////////////////////////////////////////
/////
//			Clears a block of EEPROM the index of the array is passed in and 
//      this function starts clearing there and stops at index address plus 
//			length array. 
//
/////
//////////////////////////////////////////////////////////////////////////////////
void ClearBlock(unsigned char index)
{
//	unsigned int i;
//	BYTE zerostr[32];
//			
//	for(i=0;i<ConfigEepromLength[i+1];i++){zerostr[i]= 0x00;}//zero out string
//	
//	XEEBeginWrite(ConfigEepromOffset[index]);
//	XEEWriteArray(zerostr, ConfigEepromLength[index]);	
//	sprintf(CommTxBuff,"Index Number:%i Block Zeroed\r\n",ConfigEepromName[index]);
//	RS232Write(CommTxBuff);
	
}


//	BSP_NOR_ReturnToReadMode();
//    
//  if(BSP_NOR_Erase_Block(WRITE_READ_ADDR) != NOR_STATUS_OK)
//  {
//    ubEraseStatus++; 
//  }
//  
//  /*##-4- NOR memory read/write access  ######################################*/   
//  /* Fill the buffer to write */
//  Fill_Buffer(nor_aTxBuffer, BUFFER_SIZE, 0xC20F);   
//  
//  /* Write data to the NOR memory */
//  if(BSP_NOR_WriteData(WRITE_READ_ADDR, nor_aTxBuffer, BUFFER_SIZE) != NOR_STATUS_OK)
//  {
//    ubWriteStatus++; 
//  }
//  
//  /* Read back data from the NOR memory */
//  if(BSP_NOR_ReadData(WRITE_READ_ADDR, nor_aRxBuffer, BUFFER_SIZE) != NOR_STATUS_OK)
//  {
//    ubReadStatus++; 
//  }
